cases/radiatorUnderWindow/template/0.orig/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    "(floor|ceiling|innerWall|outerWall|glass)" { type noSlip; }
    frontAndBack { type empty; }
}
