cases/radiatorUnderWindow/template/0.orig/alphat
FoamFile { version 2.0; format ascii; class volScalarField; object alphat; }
dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    "(floor|ceiling|innerWall|outerWall|glass)"
    { type compressible::alphatJayatillekeWallFunction; Prt 0.85; value uniform 0; }
    frontAndBack { type empty; }
}
