cases/radiatorUnderWindow/template/0.orig/k
FoamFile { version 2.0; format ascii; class volScalarField; object k; }
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 1e-4;
boundaryField
{
    "(floor|ceiling|innerWall|outerWall|glass)"
    { type kLowReWallFunction; value uniform 1e-4; }
    frontAndBack { type empty; }
}
