cases/radiatorUnderWindow/template/0.orig/nut
FoamFile { version 2.0; format ascii; class volScalarField; object nut; }
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    "(floor|ceiling|innerWall|outerWall|glass)"
    { type nutkWallFunction; value uniform 0; }
    frontAndBack { type empty; }
}
