cases/radiatorUnderWindow/template/0.orig/omega
FoamFile { version 2.0; format ascii; class volScalarField; object omega; }
dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 1.0;
boundaryField
{
    "(floor|ceiling|innerWall|outerWall|glass)"
    { type omegaWallFunction; value uniform 1.0; }
    frontAndBack { type empty; }
}
