cases/radiatorUnderWindow/template/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

#include "../../config/caseSettings"

scale   1;

// z thickness is exactly 1.000 m, so every flux the solver reports is already
// "per metre of window / radiator length".

vertices
(
    (0   0    0)   //  0
    (4   0    0)   //  1
    (4   0.9  0)   //  2
    (0   0.9  0)   //  3
    (0   0    1)   //  4
    (4   0    1)   //  5
    (4   0.9  1)   //  6
    (0   0.9  1)   //  7
    (4   2.1  0)   //  8
    (0   2.1  0)   //  9
    (4   2.1  1)   // 10
    (0   2.1  1)   // 11
    (4   2.4  0)   // 12
    (0   2.4  0)   // 13
    (4   2.4  1)   // 14
    (0   2.4  1)   // 15
);

xGrading
(
    (0.05 $nx1 1)
    (0.20 $nx2 3)
    (0.50 $nx3 1)
    (0.20 $nx4 0.33333)
    (0.05 $nx5 1)
);

blocks
(
    // y 0 - 0.9
    hex (0 1 2 3 4 5 6 7)
    ( #eval{ $nx1+$nx2+$nx3+$nx4+$nx5 } #eval{ $ny1+$ny2 } 1 )
    edgeGrading
    (
        $xGrading $xGrading $xGrading $xGrading
        ((0.11111 $ny1 0.4)(0.88889 $ny2 1))
        ((0.11111 $ny1 0.4)(0.88889 $ny2 1))
        ((0.11111 $ny1 0.4)(0.88889 $ny2 1))
        ((0.11111 $ny1 0.4)(0.88889 $ny2 1))
        1 1 1 1
    )

    // y 0.9 - 2.1  (window height)
    hex (3 2 8 9 7 6 10 11)
    ( #eval{ $nx1+$nx2+$nx3+$nx4+$nx5 } $ny3 1 )
    edgeGrading
    (
        $xGrading $xGrading $xGrading $xGrading
        1 1 1 1
        1 1 1 1
    )

    // y 2.1 - 2.4
    hex (9 8 12 13 11 10 14 15)
    ( #eval{ $nx1+$nx2+$nx3+$nx4+$nx5 } $ny4 1 )
    edgeGrading
    (
        $xGrading $xGrading $xGrading $xGrading
        2.5 2.5 2.5 2.5
        1 1 1 1
    )
);

edges ();

boundary
(
    floor
    {
        type wall;
        faces ( (0 1 5 4) );
    }
    ceiling
    {
        type wall;
        faces ( (13 15 14 12) );
    }
    innerWall
    {
        type wall;
        faces ( (1 2 6 5) (2 8 10 6) (8 12 14 10) );
    }
    outerWall
    {
        type wall;
        faces ( (0 4 7 3) (9 11 15 13) );
    }
    glass
    {
        type wall;
        faces ( (3 7 11 9) );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1) (3 9 8 2) (9 13 12 8)
            (4 5 6 7) (7 6 10 11) (11 10 14 15)
        );
    }
);

mergePatchPairs ();
