cases/radiatorUnderWindow/template/system/fvSchemes
FoamFile { version 2.0; format ascii; class dictionary; object fvSchemes; }

ddtSchemes      { default Euler; }
gradSchemes     { default Gauss linear; }

divSchemes
{
    default         none;
    div(phi,U)      Gauss limitedLinearV 1;
    energy          Gauss limitedLinear 1;
    div(phi,h)      $energy;
    div(phi,e)      $energy;
    div(phi,K)      Gauss linear;
    div(phi,Ekp)    Gauss linear;
    turbulence      Gauss limitedLinear 1;
    div(phi,k)      $turbulence;
    div(phi,omega)  $turbulence;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes    { default Gauss linear corrected; }
interpolationSchemes{ default linear; }
snGradSchemes       { default corrected; }

wallDist
{
    method meshWave;
}
